import React from 'react';

export default function Agreement() {
    return (
        <div className='flex flex-col gap-6'>
            <h1 className='font-semibold text-3xl'>Пользовательское соглашение</h1>
            <div className='flex flex-col gap-1'>
                <h2 className='font-bold text-lg text-onSurface'>
                    Правила пользования Сайтом ВКонтакте
                </h2>
                <div className='flex flex-col gap-6 mb-12'>
                    <span className='font-bold text-lg text-onSurfaceVariant'>
                        Добро пожаловать на Сайт ВКонтакте, интернет-ресурс, который помогает вам
                        поддерживать связь с вашими старыми и новыми друзьями. Сайт ВКонтакте
                        (vk.com, vk.ru) – это сетевой проект, объединяющий людей на основании мест
                        учебы или работы.
                    </span>
                    <span className='font-bold text-lg text-onSurfaceVariant'>
                        Вы также можете ознакомиться с Правилами защиты информации о пользователях
                        на Сайте VK.com.
                    </span>
                    <span className='font-bold text-lg text-onSurfaceVariant'>
                        Администрация Сайта предоставляет вам доступ к использованию Сайта ВКонтакте
                        и его функциональности на условиях, являющихся предметом настоящих Правил
                        пользования Сайтом ВКонтакте. В этой связи вам необходимо внимательно
                        ознакомиться с условиями настоящих Правил, которые рассматриваются
                        Администрацией Сайта как публичная оферта в соответствии со ст. 437
                        Гражданского кодекса Российской Федерации.
                    </span>
                </div>

                <h3 className='font-bold text-lg text-onSurface'>
                    1. Термины, используемые в настоящих Правилах
                </h3>
                <span className='font-medium text-base text-onSurfaceVariant'>
                    <h4 className='font-semibold text-base text-onSurface'>
                        1.1. Сайт ВКонтакте (или Сайт)
                    </h4>{' '}
                    – социальная сеть, известная под именем «ВКонтакте», размещённая на сайте в сети
                    Интернет по адресу: VK.com, VK.ru (включая все уровни указанных доменов, как
                    функционирующие на дату принятия Пользователем настоящих Правил, так и
                    запускаемые и вводимые в эксплуатацию в течение всего срока его действия) и
                    доступная Пользователю через сайт, мобильную версию сайта, приложения и иные
                    ресурсы, представляющая собой результат интеллектуальной деятельности в форме
                    программы для ЭВМ. Социальная сеть представлена в объективной форме
                    совокупностью данных и команд, и порождаемых аудиовизуальных отображений
                    (включая входящие в её состав графические изображения и пользовательский
                    интерфейс), (далее – данные и команды), предназначенных для функционирования ЭВМ
                    и мобильных устройств в целях получения определённого результата в виде
                    организации функциональности социальной сети. Совокупность данных и команд
                    состоит из активированных и неактивированных данных и команд. 1.2.
                    Неактивированные данные и команды – данные, команды и порождаемые
                    аудиовизуальные отображения, позволяющие увеличить количество виртуальных
                    ценностей, используемых в рамках функциональных возможностей Сайта. Условия
                    предоставления Администрацией Пользователю права на использование
                    неактивированных данных и команд определены в лицензионном соглашении,
                    являющемся неотъемлемой частью настоящих Правил, действующая редакция которого
                    располагается в свободном доступе в сети Интернет по адресу:
                    https://vk.com/licence, заключаемом Администрацией Сайта с Пользователем.
                </span>

                <h3 className='font-bold text-lg text-onSurface'>2. Статус Сайта ВКонтакте</h3>
                <ul>
                    <li className='font-semibold text-base text-onSurface'>
                        2.1.Настоящие Правила пользования Сайтом ВКонтакте (ранее и далее – Правила)
                        разработаны Администрацией Сайта и определяют условия использования и
                        развития Сайта, его сервисов, а также права и обязанности его Пользователей
                        и Администрации. Правила распространяются также на отношения, связанные с
                        правами и интересами третьих лиц, не являющимися Пользователями Сайта, но
                        чьи права и интересы могут быть затронуты в результате действий
                        Пользователей Сайта.
                    </li>
                    <li className='font-semibold text-base text-onSurface'>
                        2.2.Настоящие Правила являются юридически обязательным соглашением между
                        Пользователем и Администрацией Сайта, предметом которого является
                        предоставление Администрацией Сайта Пользователю доступа к использованию
                        Сайта и его функциональности. Помимо настоящих Правил, к соглашению между
                        Пользователем и Администрацией Сайта относятся все специальные документы,
                        регулирующие предоставление доступа к использованию отдельных функциональных
                        возможностей Сайта (в том числе его неактивированных данных, команд и
                        сервисов), размещённого в соответствующих разделах Сайта и/или в сервисах на
                        Сайте.
                    </li>
                    <li className='font-semibold text-base text-onSurface'>
                        2.3.Пользователь обязан полностью ознакомиться с настоящими Правилами до
                        момента регистрации на Сайте. Регистрация Пользователя на Сайте означает
                        полное и безоговорочное принятие Пользователем настоящих Правил в
                        соответствии со ст. 438 Гражданского кодекса Российской Федерации.
                    </li>
                    <li className='font-semibold text-base text-onSurface'>
                        2.4.Настоящие Правила могут быть изменены и/или дополнены Администрацией
                        Сайта в одностороннем порядке с уведомлением в течение 3 (трёх) рабочих дней
                        со дня внесения изменений и/или дополнений. Настоящие Правила являются
                        открытым и общедоступным документом. Действующая редакция Правил
                        располагается в сети Интернет по адресу:https://vk.com/terms. Администрация
                        Сайта рекомендует Пользователям регулярно проверять условия настоящих Правил
                        на предмет их изменения и/или дополнения. Продолжение использования Сайта
                        Пользователем после внесения изменений и/или дополнений в настоящие Правила
                        означает принятие и согласие Пользователя с такими изменениями и/или
                        дополнениями.
                    </li>
                </ul>
            </div>
        </div>
    );
}
